src/InformationRegisters/Scan_ПараметрыСессийПользователейПортала/Scan_ПараметрыСессийПользователейПортала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПараметрыСессийПользователейПортала</name>
  <resources>
    <name>НомерСессииПортала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательПортала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПользователяПортала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ПараметрыСессийПользователейПортала/ManagerModule.bsl
//rarus vikhle 07.04.2020 mt 15695 +++

Процедура ЗаписатьПараметрыСессийПользователейПортала (Пользователь = Неопределено, ПользовательПортала, КодПользователяПортала, НомерСессииПортала) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	Если НЕ Пользователь.ПользовательПортала Тогда
		Возврат;
	КонецЕсли;	
	НаборЗаписей = РегистрыСведений.Scan_ПараметрыСессийПользователейПортала.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь); //rarus vikhle 03.03.2021 mt 17355
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ПользовательПортала = ПользовательПортала;
	НоваяЗапись.КодПользователяПортала = КодПользователяПортала;
	НоваяЗапись.НомерСессииПортала = НомерСессииПортала;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Сообщить(НСтр("ru = 'Ошибка записи данных в регистр сведений'; en = 'Action failed'"));
	КонецПопытки;	
	
КонецПроцедуры

Функция ПолучитьДанныеПользователейПортала () Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Scan_ПараметрыСессийПользователейПортала.Пользователь КАК Пользователь,
	                |	Scan_ПараметрыСессийПользователейПортала.ПользовательПортала КАК ПользовательПортала,
	                |	Scan_ПараметрыСессийПользователейПортала.КодПользователяПортала КАК КодПользователяПортала,
	                |	Scan_ПараметрыСессийПользователейПортала.НомерСессииПортала КАК НомерСессииПортала
	                |ИЗ
	                |	РегистрСведений.Scan_ПараметрыСессийПользователейПортала КАК Scan_ПараметрыСессийПользователейПортала";
	
	РезультатЗапроса =   Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции

Функция ПроверитьНаличиеЗаписейВРегистре (Пользователь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ПараметрыСессийПользователейПортала.Пользователь КАК Пользователь,
	               |	Scan_ПараметрыСессийПользователейПортала.ПользовательПортала КАК ПользовательПортала,
	               |	Scan_ПараметрыСессийПользователейПортала.КодПользователяПортала КАК КодПользователяПортала,
	               |	Scan_ПараметрыСессийПользователейПортала.НомерСессииПортала КАК НомерСессииПортала
	               |ИЗ
	               |	РегистрСведений.Scan_ПараметрыСессийПользователейПортала КАК Scan_ПараметрыСессийПользователейПортала
	               |ГДЕ
	               |	Scan_ПараметрыСессийПользователейПортала.Пользователь = &Пользователь
	               |	И НЕ Scan_ПараметрыСессийПользователейПортала.НомерСессииПортала = """"";
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	РезультатЗапроса =  Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();	
КонецФункции	

Процедура УдалитьЗаписьРегистра(Пользователь) Экспорт
	
	НаборЗаписей = РегистрыСведений.Scan_ПараметрыСессийПользователейПортала.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Сообщить(НСтр("ru = 'Ошибка записи данных в регистр сведений'; en = 'Action failed'"));
	КонецПопытки;
КонецПроцедуры	
//rarus vikhle 07.04.2020 mt 15695 ---
